# Introduction to Pandas

## 1. Reading data

In [62]:
#From a csv file
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

df = pd.read_csv('../data-titanic/train.csv')
print(df.shape)
df.head(5)

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
#From a URL
url = "https://raw.githubusercontent.com/gsi-upm/sitc/master/ml2/data-titanic/train.csv"
df = pd.read_csv(url)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 2. Data munging

### Examining de DF

In [64]:
df.info()
df.dtypes[df.dtypes =="object"]
df.describe()

#Describing only interesting columns
df[['Survived', 'Age', 'SibSp', 'Parch', 'Fare']].describe()
print(df.duplicated().any())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
False

In [65]:
print(df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [66]:
df_modified = df.copy()

#Dropping not important columns
df_modified.drop(['Cabin', 'Ticket', 'Name'], axis=1, inplace=True)

#Filling NaN Ages with mean
df_modified['Age'] = df_modified['Age'].fillna(df['Age'].median())

#### Enconding categorical values

In [67]:
df_modified['Sex'].unique()
df_modified.loc[df_modified["Sex"] == "male", "Sex"] = 0
df_modified.loc[df_modified["Sex"] == "female", "Sex"] = 1

In [70]:
print(df_modified['Embarked'].unique())
df_modified.groupby('Embarked').size()
df_modified.fillna('S', inplace=True)

df_modified.loc[df_modified["Embarked"] == "S", "Embarked"] = 0
df_modified.loc[df_modified["Embarked"] == "C", "Embarked"] = 1
df_modified.loc[df_modified["Embarked"] == "Q", "Embarked"] = 2

['S' 'C' 'Q']
PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

     PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch   Fare Embarked
886          887         0       2    0  27.0      0      0  13.00        0
887          888         1       1    1  19.0      0      0  30.00        0
888          889         0       3    1  28.0      1      2  23.45        0
889          890         1       1    0  26.0      0      0  30.00        1
890          891         0       3    0  32.0      0      0   7.75        2

In [ ]:
print(df_modified.isnull().sum())
df_modified[-5:]